# ####################################################################

#  Created by Genus(TM) Synthesis Solution 23.14-s090_1 on Sat Nov 01 21:01:57 IST 2025

# ####################################################################

set sdc_version 2.0

set_units -capacitance 1000fF
set_units -time 1000ps

# Set the current design
current_design memory

create_clock -name "mclk" -period 3.5 -waveform {0.0 1.75} [get_ports clk_i]
create_clock -name "vclk" -period 3.5 -waveform {0.0 1.75} 
set_load -pin_load 0.008 [get_ports ready_o]
set_load -pin_load 0.008 [get_ports {rdata_o[15]}]
set_load -pin_load 0.008 [get_ports {rdata_o[14]}]
set_load -pin_load 0.008 [get_ports {rdata_o[13]}]
set_load -pin_load 0.008 [get_ports {rdata_o[12]}]
set_load -pin_load 0.008 [get_ports {rdata_o[11]}]
set_load -pin_load 0.008 [get_ports {rdata_o[10]}]
set_load -pin_load 0.008 [get_ports {rdata_o[9]}]
set_load -pin_load 0.008 [get_ports {rdata_o[8]}]
set_load -pin_load 0.008 [get_ports {rdata_o[7]}]
set_load -pin_load 0.008 [get_ports {rdata_o[6]}]
set_load -pin_load 0.008 [get_ports {rdata_o[5]}]
set_load -pin_load 0.008 [get_ports {rdata_o[4]}]
set_load -pin_load 0.008 [get_ports {rdata_o[3]}]
set_load -pin_load 0.008 [get_ports {rdata_o[2]}]
set_load -pin_load 0.008 [get_ports {rdata_o[1]}]
set_load -pin_load 0.008 [get_ports {rdata_o[0]}]
set_clock_gating_check -setup 0.0 
set_input_delay -clock [get_clocks vclk] -add_delay 1.0 [get_ports reset_i]
set_input_delay -clock [get_clocks vclk] -add_delay 1.0 [get_ports valid_i]
set_input_delay -clock [get_clocks vclk] -add_delay 1.0 [get_ports {addr_i[3]}]
set_input_delay -clock [get_clocks vclk] -add_delay 1.0 [get_ports {addr_i[2]}]
set_input_delay -clock [get_clocks vclk] -add_delay 1.0 [get_ports {addr_i[1]}]
set_input_delay -clock [get_clocks vclk] -add_delay 1.0 [get_ports {addr_i[0]}]
set_input_delay -clock [get_clocks vclk] -add_delay 1.0 [get_ports {wdata_i[15]}]
set_input_delay -clock [get_clocks vclk] -add_delay 1.0 [get_ports {wdata_i[14]}]
set_input_delay -clock [get_clocks vclk] -add_delay 1.0 [get_ports {wdata_i[13]}]
set_input_delay -clock [get_clocks vclk] -add_delay 1.0 [get_ports {wdata_i[12]}]
set_input_delay -clock [get_clocks vclk] -add_delay 1.0 [get_ports {wdata_i[11]}]
set_input_delay -clock [get_clocks vclk] -add_delay 1.0 [get_ports {wdata_i[10]}]
set_input_delay -clock [get_clocks vclk] -add_delay 1.0 [get_ports {wdata_i[9]}]
set_input_delay -clock [get_clocks vclk] -add_delay 1.0 [get_ports {wdata_i[8]}]
set_input_delay -clock [get_clocks vclk] -add_delay 1.0 [get_ports {wdata_i[7]}]
set_input_delay -clock [get_clocks vclk] -add_delay 1.0 [get_ports {wdata_i[6]}]
set_input_delay -clock [get_clocks vclk] -add_delay 1.0 [get_ports {wdata_i[5]}]
set_input_delay -clock [get_clocks vclk] -add_delay 1.0 [get_ports {wdata_i[4]}]
set_input_delay -clock [get_clocks vclk] -add_delay 1.0 [get_ports {wdata_i[3]}]
set_input_delay -clock [get_clocks vclk] -add_delay 1.0 [get_ports {wdata_i[2]}]
set_input_delay -clock [get_clocks vclk] -add_delay 1.0 [get_ports {wdata_i[1]}]
set_input_delay -clock [get_clocks vclk] -add_delay 1.0 [get_ports {wdata_i[0]}]
set_input_delay -clock [get_clocks vclk] -add_delay 1.0 [get_ports wr_rd_i]
set_output_delay -clock [get_clocks vclk] -add_delay 1.0 [get_ports ready_o]
set_output_delay -clock [get_clocks vclk] -add_delay 1.0 [get_ports {rdata_o[15]}]
set_output_delay -clock [get_clocks vclk] -add_delay 1.0 [get_ports {rdata_o[14]}]
set_output_delay -clock [get_clocks vclk] -add_delay 1.0 [get_ports {rdata_o[13]}]
set_output_delay -clock [get_clocks vclk] -add_delay 1.0 [get_ports {rdata_o[12]}]
set_output_delay -clock [get_clocks vclk] -add_delay 1.0 [get_ports {rdata_o[11]}]
set_output_delay -clock [get_clocks vclk] -add_delay 1.0 [get_ports {rdata_o[10]}]
set_output_delay -clock [get_clocks vclk] -add_delay 1.0 [get_ports {rdata_o[9]}]
set_output_delay -clock [get_clocks vclk] -add_delay 1.0 [get_ports {rdata_o[8]}]
set_output_delay -clock [get_clocks vclk] -add_delay 1.0 [get_ports {rdata_o[7]}]
set_output_delay -clock [get_clocks vclk] -add_delay 1.0 [get_ports {rdata_o[6]}]
set_output_delay -clock [get_clocks vclk] -add_delay 1.0 [get_ports {rdata_o[5]}]
set_output_delay -clock [get_clocks vclk] -add_delay 1.0 [get_ports {rdata_o[4]}]
set_output_delay -clock [get_clocks vclk] -add_delay 1.0 [get_ports {rdata_o[3]}]
set_output_delay -clock [get_clocks vclk] -add_delay 1.0 [get_ports {rdata_o[2]}]
set_output_delay -clock [get_clocks vclk] -add_delay 1.0 [get_ports {rdata_o[1]}]
set_output_delay -clock [get_clocks vclk] -add_delay 1.0 [get_ports {rdata_o[0]}]
set_driving_cell -lib_cell BUFX12 -library slow_vdd1v0 -pin "Y" [get_ports clk_i]
set_driving_cell -lib_cell BUFX12 -library slow_vdd1v0 -pin "Y" [get_ports reset_i]
set_driving_cell -lib_cell BUFX12 -library slow_vdd1v0 -pin "Y" [get_ports valid_i]
set_driving_cell -lib_cell BUFX12 -library slow_vdd1v0 -pin "Y" [get_ports {addr_i[3]}]
set_driving_cell -lib_cell BUFX12 -library slow_vdd1v0 -pin "Y" [get_ports {addr_i[2]}]
set_driving_cell -lib_cell BUFX12 -library slow_vdd1v0 -pin "Y" [get_ports {addr_i[1]}]
set_driving_cell -lib_cell BUFX12 -library slow_vdd1v0 -pin "Y" [get_ports {addr_i[0]}]
set_driving_cell -lib_cell BUFX12 -library slow_vdd1v0 -pin "Y" [get_ports {wdata_i[15]}]
set_driving_cell -lib_cell BUFX12 -library slow_vdd1v0 -pin "Y" [get_ports {wdata_i[14]}]
set_driving_cell -lib_cell BUFX12 -library slow_vdd1v0 -pin "Y" [get_ports {wdata_i[13]}]
set_driving_cell -lib_cell BUFX12 -library slow_vdd1v0 -pin "Y" [get_ports {wdata_i[12]}]
set_driving_cell -lib_cell BUFX12 -library slow_vdd1v0 -pin "Y" [get_ports {wdata_i[11]}]
set_driving_cell -lib_cell BUFX12 -library slow_vdd1v0 -pin "Y" [get_ports {wdata_i[10]}]
set_driving_cell -lib_cell BUFX12 -library slow_vdd1v0 -pin "Y" [get_ports {wdata_i[9]}]
set_driving_cell -lib_cell BUFX12 -library slow_vdd1v0 -pin "Y" [get_ports {wdata_i[8]}]
set_driving_cell -lib_cell BUFX12 -library slow_vdd1v0 -pin "Y" [get_ports {wdata_i[7]}]
set_driving_cell -lib_cell BUFX12 -library slow_vdd1v0 -pin "Y" [get_ports {wdata_i[6]}]
set_driving_cell -lib_cell BUFX12 -library slow_vdd1v0 -pin "Y" [get_ports {wdata_i[5]}]
set_driving_cell -lib_cell BUFX12 -library slow_vdd1v0 -pin "Y" [get_ports {wdata_i[4]}]
set_driving_cell -lib_cell BUFX12 -library slow_vdd1v0 -pin "Y" [get_ports {wdata_i[3]}]
set_driving_cell -lib_cell BUFX12 -library slow_vdd1v0 -pin "Y" [get_ports {wdata_i[2]}]
set_driving_cell -lib_cell BUFX12 -library slow_vdd1v0 -pin "Y" [get_ports {wdata_i[1]}]
set_driving_cell -lib_cell BUFX12 -library slow_vdd1v0 -pin "Y" [get_ports {wdata_i[0]}]
set_driving_cell -lib_cell BUFX12 -library slow_vdd1v0 -pin "Y" [get_ports wr_rd_i]
set_wire_load_mode "enclosed"
set_clock_uncertainty -setup 0.4 [get_clocks mclk]
set_clock_uncertainty -hold 0.4 [get_clocks mclk]
set_clock_uncertainty -setup 0.4 [get_clocks vclk]
set_clock_uncertainty -hold 0.4 [get_clocks vclk]
set_false_path -from [get_ports scan_in]
set_false_path -from [get_ports SE]
